<a href="https://colab.research.google.com/github/glebmikha/sql-course/blob/main/2-connect-and-upload/toy_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({'user_id':[1,2,3],
                   'user_name':['a','b','c']})

In [5]:
df

   user_id user_name
0        1         a
1        2         b
2        3         c

In [6]:
import sqlite3

In [7]:
con = sqlite3.connect('db')

In [8]:
df.to_sql('users',con,index=False,if_exists='replace')

In [9]:
sql = '''select * from users t'''

In [10]:
pd.read_sql(sql,con)

   user_id user_name
0        1         a
1        2         b
2        3         c

In [11]:
def select(sql):
  return pd.read_sql(sql,con)

In [12]:
select(sql)

   user_id user_name
0        1         a
1        2         b
2        3         c

https://docs.google.com/spreadsheets/d/18ndcpusUcr2EuyuMhWvb1ftPwqIxL4ySV7vBufinLK4/edit?usp=sharing

In [13]:
id = '18ndcpusUcr2EuyuMhWvb1ftPwqIxL4ySV7vBufinLK4'

In [14]:
df = pd.read_csv(f'https://docs.google.com/spreadsheets/d/{id}/export?format=csv')

In [15]:
df

   user_id name
0        2    b
1        3    c
2        4    d

In [19]:
df.to_sql('users2',con,index=False,if_exists='replace')

In [20]:
sql = '''select * from users2 t'''

In [21]:
select(sql)

   user_id name
0        2    b
1        3    c
2        4    d